Tekla.Structures.Plugins.DirectManipulation.Internal.Features.BaseComponentCreationFeatureBase
The Tekla.Structures.Plugins.DirectManipulation.Internal.Features.BaseComponentCreationFeatureBase class provides the base class for creating the components or custom parts.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.BaseComponentCreationFeatureBase.description
The object type description.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.BaseComponentCreationFeatureBase.#ctor(System.Int32,System.String,System.Boolean)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Internal.Features.BaseComponentCreationFeatureBase class.
id: The identifier.
name: The name.
useFeatureContextualToolBar:
The System.Boolean value to indicate whether the feature level contextual toolbar should be used.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.BaseComponentCreationFeatureBase.ManipulatorManager
The manipulator manager.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.BaseComponentCreationFeatureBase.Initialize
Initializes the feature.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.BaseComponentCreationFeatureBase.Refresh
Refreshes the feature.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.BaseComponentCreationFeatureBase.OnActivated(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)


Tekla.Structures.Plugins.DirectManipulation.Internal.Features.BaseComponentCreationFeatureBase.OnRefreshSuggested(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)


Tekla.Structures.Plugins.DirectManipulation.Internal.Features.BaseComponentCreationFeatureBase.GetActivationDefinitions
